modules/admin/views/article/index.php

            [
                'label'=>'Пользователь',
                'value' => function ($data) {
                return User::findOne(['id'=>$data->user_id])->username;
---
SELECT * FROM `user` WHERE `id` IS NULL

            [
                'label'=>'Категории',
                'value' => function ($data) {
                return Category::findOne(['id'=>$data->category_id])->title;
---
SELECT * FROM `category` WHERE `id` IS NULL