views/particals/sidebar.php

SELECT COUNT(*) FROM `article` WHERE `category_id`=1
---
                <?php foreach($categories as $category): ?>
                    <li>
                        <a href="<?= Url::toRoute(['site/category', 'id' => $category->id]); ?>"> <?= $category->getArticleCount(); ?> </a>
                         <span class="post-count pull-right"> (<?= $category->getArticles()->count(); ?>) </span>