models/Article.php

SELECT COUNT(*) FROM `article`
SELECT * FROM `article` LIMIT 5
---
    public  static function getAll($pageSize = 5)
    {
        $query = Article::find();
        $count = $query->count();
        $pagination = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $articles = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `article` ORDER BY `viewed` DESC LIMIT 3
---
    public static function getPopular()
    {
        return Article::find()->orderBy('viewed desc')->limit(3)->all();

SELECT * FROM `article` ORDER BY `date` LIMIT 4
---
    public static function getRecent()
    {
        return Article::find()->orderBy('date asc')->limit(4)->all();