models/Category.php

SELECT COUNT(*) FROM `article` WHERE `category_id`=1
---
    public function getArticleCount()
    {
        return $this->getArticles()->count();

SELECT * FROM `category`
---
    public static function getAll()
    {
        return Category::find()->all();