models/User.php

    public static function findIdentity($id)
    {
        return User::findOne($id);
---
SELECT * FROM `user` WHERE `id`=3